In [72]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways.)','12. Air France', '"Swiss Air"']})

#Show dataframe
df

            From_To  FlightNumber  RecentDelays             Airline
0      LoNDon_paris       10045.0      [23, 47]              KLM(!)
1      MAdrid_miLAN           NaN            []   <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways.)
3    Budapest_PaRis           NaN          [13]      12. Air France
4   Brussels_londOn       10085.0      [67, 32]         "Swiss Air"

1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [76]:
#Method 1
df['FlightNumber'].fillna(df['FlightNumber'].shift(1)+10, inplace=True)

#Method 2 (looping method)
for i in range(len(df)) : 
  if np.isnan(df.loc[i, "FlightNumber"]):
    df.loc[i,"FlightNumber"] = df.loc[i-1,"FlightNumber"]+10 

df["FlightNumber"] = df["FlightNumber"].astype(int)
df

            From_To  FlightNumber  RecentDelays             Airline
0      LoNDon_paris         10045      [23, 47]              KLM(!)
1      MAdrid_miLAN         10055            []   <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways.)
3    Budapest_PaRis         10075          [13]      12. Air France
4   Brussels_londOn         10085      [67, 32]         "Swiss Air"

2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [77]:
From_destination = df['From_To'].apply(lambda x: x.split("_")[0])
To_destination = df['From_To'].apply(lambda x: x.split("_")[1])
destination_dict = { 'From_destination': From_destination, 'To_destination': To_destination }
temp_df = pd.DataFrame(destination_dict)
temp_df

  From_destination To_destination
0           LoNDon          paris
1           MAdrid          miLAN
2           londON      StockhOlm
3         Budapest          PaRis
4         Brussels         londOn

3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [78]:
temp_df["From_destination"] = temp_df["From_destination"].apply(lambda x:x.capitalize())
temp_df["To_destination"] = temp_df["To_destination"].apply(lambda x:x.capitalize())
temp_df

  From_destination To_destination
0           London          Paris
1           Madrid          Milan
2           London      Stockholm
3         Budapest          Paris
4         Brussels         London

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [79]:
df = pd.concat([df,temp_df], axis = 1)
df.drop(["From_To"],axis = 1, inplace = True)
df

   FlightNumber  RecentDelays  ... From_destination To_destination
0         10045      [23, 47]  ...           London          Paris
1         10055            []  ...           Madrid          Milan
2         10065  [24, 43, 87]  ...           London      Stockholm
3         10075          [13]  ...         Budapest          Paris
4         10085      [67, 32]  ...         Brussels         London

[5 rows x 5 columns]

5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [80]:
delays = df["RecentDelays"].apply(pd.Series)

delays_col_name = ["delay_"+str(i+1) for i in range(len(delays.columns))]

delays.columns = delays_col_name

print(delays)

pd.concat([df,delays], axis = 1)

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

   FlightNumber  RecentDelays             Airline  ... delay_1 delay_2  delay_3
0         10045      [23, 47]              KLM(!)  ...    23.0    47.0      NaN
1         10055            []   <Air France> (12)  ...     NaN     NaN      NaN
2         10065  [24, 43, 87]  (British Airways.)  ...    24.0    43.0     87.0
3         10075          [13]      12. Air France  ...    13.0     NaN      NaN
4         10085      [67, 32]         "Swiss Air"  ...    67.0    32.0      NaN

[5 rows x 8 columns]